-- -------------------------------------------- --
--            HoopFather Website SQL            --
-- -------------------------------------------- --


-- -------------------------------------------- --
--            database: site                    --
--            author: woneway                   --
--            date: 2018/4/11                   --
-- -------------------------------------------- --


-- -------------------------------------------- --
--        database      |       site            --
-- -------------------------------------------- --
--        charset       |       utf8            --
-- -------------------------------------------- --
--        collate       |       utf8_general_ci --
-- -------------------------------------------- --
drop database if exists `site`;
create database `site` default charset utf8 collate utf8_general_ci;

-- -------------------------------------------- --
-- -------------------------------------------- --
--        table         |  site_user       		--
-- -------------------------------------------- --
--        charset       |  utf8         	    --
-- -------------------------------------------- --
--        collate       |  utf8_general_ci 		--
-- -------------------------------------------- --
--        userId        |  int primarykey  		--
-- -------------------------------------------- --
--        userName      |  varchar(50)    		--
-- -------------------------------------------- --
--        userAddr      |  varchar(100)    		--
-- -------------------------------------------- --
--        userEmail     |  varchar(30)     		--
-- -------------------------------------------- --
--        userPwd   	|  varchar(20)     		--
-- -------------------------------------------- --
--        userState 	|  int             		--
-- -------------------------------------------- --
--        userCode  	|  varchar(100)    		--
-- -------------------------------------------- --
-- -------------------------------------------- --

drop table if exists `site`.`site_user`;
create table `site`.`site_user`(
	`userId` int(11) not null auto_increment,
    `userName` varchar(50),
    `userAddr` varchar(100),
    `userEmail` varchar(30),    
    `userState` int(11),
    `userCode` varchar(100),
    `userPwd` varchar(20),
    primary key(`userId`)
)engine=InnoDB default charset utf8 collate utf8_general_ci;

-- -------------------------------------------- --
--                  insert site_user            --
-- -------------------------------------------- --
insert into `site`.`site_user`(`userName`,`userAddr`,`userEmail`,`userState`,`userCode`,`userPwd`)
		values ("张三","江苏南京","17254867823@163.com","1","","123"),
			   ("李四","安徽合肥","18214554884@163.com","1","","123"),
			   ("王五","北京","18756997745@163.com","1","","123"),
               ("李天","山东济南","17214554884@163.com","1","","123"),
               ("Lily","NewYork","15204558745@163.com","1","","123"),
               ("刘浩","湖南长沙","19148878783@163.com","1","","123"),
               ("刘伟","安徽合肥","15687996155@163.com","1","","123"),
               ("李福胜","湖北武汉","1756974478@163.com","1","","123"),
               ("陆河","江西南昌","17964787744@163.com","1","","123"),
               ("田波","江苏南通","18789913384@163.com","1","","123");


-- -------------------------------------------- --
-- -------------------------------------------- --
--        table         |  site_skill      		--
-- -------------------------------------------- --
--        charset   	|  utf8           		--
-- -------------------------------------------- --
--        collate   	|  utf8_general_ci 		--
-- -------------------------------------------- --
--        skillId   	|  int primarykey  		--
-- -------------------------------------------- --
--        skillTitle	|  varchar(50)     		--
-- -------------------------------------------- --
--        skillDesc 	|  varchar(6000)   		--
-- -------------------------------------------- --
--        skillPoster	|  varchar(255)    		--
-- -------------------------------------------- --
--        skillLink     |  varchar(255)    		--
-- -------------------------------------------- --
--        skillDate     |  datetime            	--
-- -------------------------------------------- --
-- -------------------------------------------- --

drop table if exists `site`.`site_skill`;
create table `site`.`site_skill`(
	`skillId` int(11) not null auto_increment,
    `skillTitle` varchar(50),
    `skillDesc` varchar(6000),
    `skillPoster` varchar(255),
    `skillLink` varchar(255),
    `skillDate` datetime,
    primary key(`skillId`)
)engine=InnoDB default charset utf8 collate utf8_general_ci;

insert into `site`.`site_skill`(`skillTitle`,`skillDesc`,`skillPoster`,`skillLink`, `skillDate`)
		values
			("博鳌开大会","&nbsp;&nbsp;习近平强调，2018年是中国改革开放40周年。40年众志成城，40年砥砺奋进，40年春风化雨，中国人民用双手书写了国家和民族发展的壮丽史诗。40年来，中国人民始终艰苦奋斗、顽强拼搏，极大解放和发展了中国社会生产力，推动中国发生了翻天覆地的变化。40年来，中国人民始终上下求索、锐意进取，坚持立足国情、放眼世界，既强调独立自主、自力更生又注重对外开放、合作共赢，既坚持社会主义制度又坚持社会主义市场经济改革方向，既“摸着石头过河”又加强顶层设计，成功开辟出一条中国特色社会主义道路。40年来，中国人民始终与时俱进、一往无前，坚持解放思想、实事求是，勇于自我革命、自我革新，敢闯敢试、敢为人先，充分显示了思想引领、制度保障和13亿多人民推动历史前进的强大力量。40年来，中国人民始终敞开胸襟、拥抱世界，坚持对外开放基本国策，打开国门搞建设，成功实现从封闭半封闭到全方位开放的伟大转折，成为世界经济增长的主要稳定器和动力源，为人类和平与发展的崇高事业作出了中国贡献。","/images/1.jpg","/jq22-sp.mp4","2018-04-11 11:56:32");

-- -------------------------------------------- --
-- -------------------------------------------- --
--        table         |  site_news      		--
-- -------------------------------------------- --
--        charset   	|  utf8           		--
-- -------------------------------------------- --
--        collate   	|  utf8_general_ci 		--
-- -------------------------------------------- --
--        newsId     	|  int primarykey  		--
-- -------------------------------------------- --
--        newsTitle 	|  varchar(50)     		--
-- -------------------------------------------- --
--        newsContent 	|  varchar(10000)  		--
-- -------------------------------------------- --
--        newsAuthor	|  varchar(30)    		--
-- -------------------------------------------- --
--        newsDate      |  datetime      		--
-- -------------------------------------------- --
--        newsPhoto     |  varchar(255)       	--
-- -------------------------------------------- --
-- -------------------------------------------- --

drop table if exists `site`.`site_news`;
create table `site`.`site_news`(
	`newsId` int(11) not null auto_increment,
    `newsTitle` varchar(50),
    `newsContent` varchar(10000),
	`newsPhoto` varchar(255),
    `newsAuthor` varchar(30),
    `newsDate` datetime,
    primary key(`newsId`)
)engine=InnoDB default charset utf8 collate utf8_general_ci;

insert into `site`.`site_news`(`newsTitle`,`newsContent`,`newsPhoto`,`newsAuthor` ,`newsDate`)
		values 
			("东西部季后赛最终排名预测：西部第8花落谁家?","   <p>虎扑4月11日讯&nbsp;2017-18赛季常规赛将在明天迎来收官，东西部季后赛战绩排名也将随之彻底定下。</p>

<p>目前，东部3支球队已提前锁定排名：第1的猛龙、第2的凯尔特人以及第5的步行者。西部有2支球队提前锁定排名：第1的火箭以及第2的勇士。</p>

<p>接下来，我们逐个分析一下明日收官战对于东西部格局的影响。</p>

<p><strong>东部3-4名之争</strong></p>

<p>1.骑士赢尼克斯，76人输雄鹿&mdash;&mdash;骑士第3，76人第4</p>

<p>2.骑士赢尼克斯，76人赢雄鹿&mdash;&mdash;76人第3，骑士第4</p>

<p>3.骑士输尼克斯，76人输雄鹿&mdash;&mdash;76人第3，骑士第4</p>

<p>4.骑士输尼克斯，76人赢雄鹿&mdash;&mdash;76人第3，骑士第4</p>

<p><strong>东部6-8名之争</strong></p>

<p>1.猛龙赢热火，奇才赢魔术，76人赢雄鹿&mdash;&mdash;奇才第6，雄鹿第7，热火第8</p>

<p>2.猛龙赢热火，奇才赢魔术，76人输雄鹿&mdash;&mdash;雄鹿第6，奇才第7，热火第8</p>

<p>3.猛龙赢热火，奇才输魔术，76人赢雄鹿&mdash;&mdash;雄鹿第6，热火第7，奇才第8</p>

<p>4.猛龙赢热火，奇才输魔术，76人输雄鹿&mdash;&mdash;雄鹿第6，热火第7，奇才第8</p>

<p>5.热火赢猛龙，奇才赢魔术，76人赢雄鹿&mdash;&mdash;热火第6，奇才第7，雄鹿第8</p>

<p>6.热火赢猛龙，奇才赢魔术，76人输雄鹿&mdash;&mdash;雄鹿第6，热火第7，奇才第8</p>

<p>7.热火赢猛龙，奇才输魔术，76人赢雄鹿&mdash;&mdash;热火第6，雄鹿第7，奇才第8</p>

<p>8.热火赢猛龙，奇才输魔术，76人输雄鹿&mdash;&mdash;雄鹿第6，热火第7，奇才第8</p>

<p><strong>西部3-8名之争</strong></p>

<p>1.掘金赢，鹈鹕赢，灰熊赢，开拓者赢&mdash;&mdash;开拓者第3，爵士第4，鹈鹕第5，掘金第6，马刺第7，雷霆第8</p>

<p>2.掘金赢，鹈鹕赢，灰熊赢，爵士赢&mdash;&mdash;爵士第3，开拓者第4，鹈鹕第5，掘金第6，马刺第7，雷霆第8</p>

<p>3.掘金赢，鹈鹕赢，雷霆赢，开拓者赢&mdash;&mdash;开拓者第3，雷霆第4，爵士第5，鹈鹕第6，掘金第7，马刺第8</p>

<p>4.掘金赢，鹈鹕赢，雷霆赢，爵士赢&mdash;&mdash;爵士第3，开拓者第4，鹈鹕第5，雷霆第6，掘金第7，马刺第8</p>

<p>5.掘金赢，马刺赢，灰熊赢，开拓者赢&mdash;&mdash;开拓者第3，爵士第4，马刺第5，掘金第6，鹈鹕第7，雷霆第8</p>

<p>6.掘金赢，马刺赢，灰熊赢，爵士赢&mdash;&mdash;爵士第3，马刺第4，开拓者第5，掘金第6，鹈鹕第7，雷霆第8</p>

<p>7.掘金赢，马刺赢，雷霆赢，开拓者赢&mdash;&mdash;开拓者第3，爵士第4，马刺第5，雷霆第6，掘金第7，鹈鹕第8</p>

<p>8.掘金赢，马刺赢，雷霆赢，爵士赢&mdash;&mdash;爵士第3，开拓者第4，马刺第5，雷霆第6，掘金第7，鹈鹕第8</p>

<p>9.森林狼赢，鹈鹕赢，灰熊赢，开拓者赢&mdash;&mdash;开拓者第3，爵士第4，鹈鹕第5，马刺第6，森林狼第7，雷霆第8</p>

<p>10.森林狼赢，鹈鹕赢，灰熊赢，爵士赢&mdash;&mdash;爵士第3，开拓者第4，鹈鹕第5，马刺第6，森林狼第7，雷霆第8</p>

<p>11.森林狼赢，鹈鹕赢，雷霆赢，开拓者赢&mdash;&mdash;开拓者第3，雷霆第4，爵士第5，鹈鹕第6，马刺第7，森林狼第8</p>

<p>12.森林狼赢，鹈鹕赢，雷霆赢，爵士赢&mdash;&mdash;爵士第3，开拓者第4，鹈鹕第5，雷霆第6，马刺第7，森林狼第8</p>

<p>13.森林狼赢，马刺赢，灰熊赢，开拓者赢&mdash;&mdash;开拓者第3，爵士第4，马刺第5，森林狼第6，鹈鹕第7，雷霆第8</p>

<p>14.森林狼赢，马刺赢，灰熊赢，爵士赢&mdash;&mdash;爵士第3，马刺第4，开拓者第5，森林狼第6，鹈鹕第7，雷霆第8</p>

<p>15.森林狼赢，马刺赢，雷霆赢，开拓者赢&mdash;&mdash;开拓者第3，雷霆第4，爵士第5，马刺第6，森林狼第7，鹈鹕第8</p>

<p>16.森林狼赢，马刺赢，雷霆赢，爵士赢&mdash;&mdash;爵士第3，开拓者第4，马刺第5，雷霆第6，森林狼第7，鹈鹕第8</p>","https://c1.hoopchina.com.cn/uploads/star/event/images/180411/4a2a8865f0b2a0b4d602a660c3c9a2ec1a4f94cf.png",
"银时","2018-04-11 15:50:34");
